Table of Contents
 Enum DeflectionRequirementEc2
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
deflection calculation requirements
public enum DeflectionRequirementEc2
Fields
Advanced = 1
Deflections that could damage adjacent parts of the structure should be limited.
Normal = 0
The appearance and general utility of the structure could be impaired when the calculated sag of a beam, slab or cantilever subjected to quasi-permanent loads exceeds span/250.
Fields
 Name |  Description
 Advanced = 1
Deflections that could damage adjacent parts of the structure should be limited.
 Normal = 0
The appearance and general utility of the structure could be impaired when the calculated sag of a beam, slab or cantilever subjected to quasi-permanent loads exceeds span/250.
 Edit this page